Repository: oriveo/oriveo
Catalog: ios/Oriveo/Oriveo/Providers.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, id, ja, ko, pt_br, ru, th, tr, vi, zh_hans, zh_hant

source: Authorize with your x.ai account to use your SuperGrok or X Premium quota. No API credits are used.
ar: امنح الإذن عبر حساب x.ai لاستخدام حصتك في SuperGrok أو X Premium. لا يتم استهلاك أرصدة API.
de: Autorisiere mit deinem x.ai-Konto, um dein SuperGrok- oder X-Premium-Kontingent zu nutzen. Es werden keine API-Credits verbraucht.
es: Autoriza con tu cuenta de x.ai para usar tu cuota de SuperGrok o X Premium. No se consumen créditos de API.
fr: Autorisez avec votre compte x.ai pour utiliser votre quota SuperGrok ou X Premium. Aucun crédit API n'est consommé.
hi: अपने SuperGrok या X Premium कोटा का उपयोग करने के लिए x.ai खाते से अनुमति दें। कोई API क्रेडिट खर्च नहीं होता।
id: Beri otorisasi dengan akun x.ai untuk memakai kuota SuperGrok atau X Premium Anda. Tidak memakai kredit API.
ja: x.ai アカウントで承認すると、SuperGrok または X Premium の利用枠を使えます。API クレジットは消費しません。
ko: x.ai 계정으로 승인하면 SuperGrok 또는 X Premium 할당량을 사용할 수 있습니다. API 크레딧은 소모되지 않습니다.
pt_br: Autorize com sua conta x.ai para usar sua cota do SuperGrok ou X Premium. Nenhum crédito de API é consumido.
ru: Авторизуйтесь через аккаунт x.ai, чтобы использовать квоту SuperGrok или X Premium. API-кредиты не расходуются.
th: อนุญาตด้วยบัญชี x.ai เพื่อใช้โควตา SuperGrok หรือ X Premium ของคุณ ไม่ใช้เครดิต API
tr: SuperGrok veya X Premium kotanı kullanmak için x.ai hesabınla yetkilendir. API kredisi harcanmaz.
vi: Ủy quyền bằng tài khoản x.ai để dùng hạn mức SuperGrok hoặc X Premium. Không tiêu tốn API credit.
zh_hans: 用 x.ai 账号完成授权，即可使用你的 SuperGrok 或 X Premium 额度，不消耗 API credit。
zh_hant: 用 x.ai 帳號完成授權，即可使用你的 SuperGrok 或 X Premium 額度，不消耗 API credit。

source: Auto-detect
ar: اكتشاف تلقائي
de: Automatische Erkennung
es: Detección automática
fr: Détection automatique
hi: ऑटो का पता लगाने
id: Deteksi otomatis
ja: 自動検出
ko: 자동 감지
pt_br: Detecção automática
ru: Автообнаружение
th: ตรวจจับอัตโนมัติ
tr: Otomatik algılama
vi: Tự động phát hiện
zh_hans: 自动检测
zh_hant: 自動偵測

source: Auto-filled
ar: تم الملء تلقائيًا
de: Automatisch ausgefüllt
es: Autocompletado
fr: Rempli automatiquement
hi: स्वतः भरण
id: Terisi otomatis
ja: 自動入力済み
ko: 자동 입력됨
pt_br: Preenchido automaticamente
ru: Автозаполнение
th: เติมอัตโนมัติ
tr: Otomatik doldurulmuş
vi: Tự động điền
zh_hans: 已自动填写
zh_hant: 已自動填寫

source: Automatic
ar: تلقائي
de: Automatisch
es: Automático
fr: Automatique
hi: स्वचालित
id: Otomatis
ja: 自動
ko: 자동
pt_br: Automático
ru: Автоматически
th: อัตโนมัติ
tr: Otomatik
vi: Tự động
zh_hans: 自动
zh_hant: 自動

source: Automatic (Recommended)
ar: تلقائي (مستحسن)
de: Automatisch (empfohlen)
es: Automático (recomendado)
fr: Automatique (recommandé)
hi: स्वचालित (अनुशंसित)
id: Otomatis (Disarankan)
ja: 自動 (推奨)
ko: 자동(권장)
pt_br: Automático (recomendado)
ru: Автоматический (рекомендуется)
th: อัตโนมัติ (แนะนำ)
tr: Otomatik (Önerilen)
vi: Tự động (Khuyến nghị)
zh_hans: 自动（推荐）
zh_hant: 自動（建議）

source: Automatic protocol testing failed: %@
ar: فشل اختبار البروتوكول التلقائي: %@
de: Fehler beim automatischen Protokolltest: %@
es: La prueba automática del protocolo falló: %@
fr: Échec du test automatique du protocole : %@
hi: स्वचालित प्रोटोकॉल परीक्षण विफल: %@
id: Pengujian protokol otomatis gagal: %@
ja: 自動プロトコルテストが失敗しました: %@
ko: 자동 프로토콜 테스트 실패: %@
pt_br: Falha no teste automático de protocolo: %@
ru: Не удалось выполнить автоматическое тестирование протокола: %@.
th: การทดสอบโปรโตคอลอัตโนมัติล้มเหลว: %@
tr: Otomatik protokol testi başarısız oldu: %@
vi: Kiểm tra giao thức tự động không thành công: %@
zh_hans: 自动协议测试失败：%@
zh_hant: 自動協議測試失敗：%@

source: Balance:
ar: الرصيد:
de: Guthaben:
es: Saldo:
fr: Solde:
hi: शेष राशि:
id: Saldo:
ja: 残高：
ko: 잔액:
pt_br: Saldo:
ru: Баланс:
th: ยอดคงเหลือ:
tr: Bakiye:
vi: Số dư:
zh_hans: 余额：
zh_hant: 餘額：

# Base URL
source: Request URL
ar: عنوان URL للطلب
de: Anfrage-URL
es: URL de solicitud
fr: URL de requête
hi: अनुरोध URL
id: URL Permintaan
ja: リクエスト URL
ko: 요청 URL
pt_br: URL da solicitação
ru: URL запроса
th: URL คำขอ
tr: İstek URL'si
vi: URL yêu cầu
zh_hans: 请求地址
zh_hant: 請求地址

source: Basic Settings
ar: الإعدادات الأساسية
de: Grundeinstellungen
es: Ajustes básicos
fr: Réglages de base
hi: मूल सेटिंग
id: Pengaturan dasar
ja: 基本設定
ko: 기본 설정
pt_br: Configurações básicas
ru: Основные настройки
th: การตั้งค่าพื้นฐาน
tr: Temel ayarlar
vi: Cài đặt cơ bản
zh_hans: 常用
zh_hant: 常用

source: Beijing (China Mainland)
ar: بكين (البر الرئيسي للصين)
de: Peking (Festlandchina)
es: Pekín (China continental)
fr: Pékin (Chine continentale)
hi: बीजिंग (चीन मुख्यभूमि)
id: Beijing (Tiongkok Daratan)
ja: 北京（中国本土）
ko: 베이징(중국 본토)
pt_br: Pequim (China continental)
ru: Пекин (материковый Китай)
th: ปักกิ่ง (จีนแผ่นดินใหญ่)
tr: Pekin (Çin Anakarası)
vi: Bắc Kinh (Trung Quốc đại lục)
zh_hans: 北京（中国大陆）
zh_hant: 北京（中國大陸）

source: Built-in web search
ar: بحث ويب مدمج
de: Integrierte Websuche
es: Búsqueda web integrada
fr: Recherche Web intégrée
hi: अंतर्निहित वेब खोज
id: Pencarian web bawaan
ja: ウェブ検索内蔵
ko: 내장 웹 검색
pt_br: Busca na web integrada
ru: Встроенный веб-поиск
th: ค้นหาเว็บในตัว
tr: Yerleşik web araması
vi: Tìm kiếm web tích hợp
zh_hans: 内置联网搜索
zh_hant: 內建網路搜尋

source: By Provider
ar: حسب المزوّد
de: Nach Anbieter
es: Por proveedor
fr: Par fournisseur
hi: प्रदाता द्वारा
id: Oleh Penyedia
ja: プロバイダ別
ko: 제공업체별
pt_br: Por provedor
ru: По поставщику
th: โดยผู้ให้บริการ
tr: Sağlayıcıya göre
vi: Theo nhà cung cấp
zh_hans: 按服务商
zh_hant: 按服務商

source: Can search the web
ar: يمكنه البحث في الويب
de: Kann im Web suchen
es: Puede buscar en la web
fr: Peut chercher sur le web
hi: वेब खोज सकता है
id: Bisa mencari di web
ja: ウェブ検索可
ko: 웹 검색 가능
pt_br: Pode pesquisar na web
ru: Может искать в вебе
th: ค้นเว็บได้
tr: Web'de arayabilir
vi: Có thể tìm trên web
zh_hans: 可联网
zh_hant: 可聯網

source: Can think
ar: يمكنه التفكير
de: Kann denken
es: Puede razonar
fr: Peut réfléchir
hi: सोच सकता है
id: Bisa berpikir
ja: 思考可
ko: 사고 가능
pt_br: Pode raciocinar
ru: Может рассуждать
th: คิดได้
tr: Düşünebilir
vi: Có thể suy nghĩ
zh_hans: 可思考
zh_hant: 可思考

source: Capabilities
ar: القدرات
de: Funktionen
es: Capacidades
fr: Capacités
hi: क्षमताएँ
id: Kemampuan
ja: 機能
ko: 기능
pt_br: Recursos
ru: Возможности
th: ความสามารถ
tr: Yetenekler
vi: Khả năng
zh_hans: 能力
zh_hant: 能力

source: Cash
ar: نقدًا
de: Guthaben
es: Efectivo
fr: Espèces
hi: नकद
id: Tunai
ja: 現金
ko: 현금
pt_br: Dinheiro
ru: Наличные
th: เงินสด
tr: Nakit
vi: Tiền mặt
zh_hans: 现金
zh_hant: 現金

source: Catalog detection is not enough. Automatic testing sends at most 1 token through the real chat path and selects a working protocol for you.
ar: الكشف عن الكتالوج ليس كافيا. يرسل الاختبار التلقائي رمزًا واحدًا على الأكثر عبر مسار الدردشة الحقيقي ويحدد بروتوكول العمل المناسب لك.
de: Die Katalogerkennung reicht nicht aus. Beim automatischen Test wird höchstens 1 Token über den echten Chat-Pfad gesendet und ein funktionierendes Protokoll für Sie ausgewählt.
es: La detección de catálogos no es suficiente. Las pruebas automáticas envían como máximo 1 token a través de la ruta de chat real y seleccionan un protocolo de trabajo para usted.
fr: La détection du catalogue ne suffit pas. Les tests automatiques envoient au maximum 1 jeton via le chemin de discussion réel et sélectionnent un protocole fonctionnel pour vous.
hi: कैटलॉग पहचान पर्याप्त नहीं है. स्वचालित परीक्षण वास्तविक चैट पथ के माध्यम से अधिकतम 1 टोकन भेजता है और आपके लिए एक कार्यशील प्रोटोकॉल का चयन करता है।
id: Deteksi katalog saja tidak cukup. Pengujian otomatis mengirimkan paling banyak 1 token melalui jalur obrolan sebenarnya dan memilih protokol yang berfungsi untuk Anda.
ja: カタログ検出だけでは十分ではありません。自動テストでは、実際のチャット パスを通じて最大 1 つのトークンが送信され、動作するプロトコルが選択されます。
ko: 카탈로그 감지만으로는 충분하지 않습니다. 자동 테스트는 실제 채팅 경로를 통해 최대 1개의 토큰을 보내고 작동 프로토콜을 선택합니다.
pt_br: A detecção de catálogo não é suficiente. O teste automático envia no máximo 1 token através do caminho real do chat e seleciona um protocolo funcional para você.
ru: Обнаружения каталога недостаточно. Автоматическое тестирование отправляет не более 1 токена по реальному пути чата и выбирает для вас рабочий протокол.
th: การตรวจหาแคตตาล็อกไม่เพียงพอ การทดสอบอัตโนมัติจะส่งโทเค็นได้สูงสุด 1 รายการผ่านเส้นทางแชทจริงและเลือกโปรโตคอลที่ใช้งานได้สำหรับคุณ
tr: Katalog tespiti yeterli değildir. Otomatik test, gerçek sohbet yolu üzerinden en fazla 1 token gönderir ve sizin için bir çalışma protokolü seçer.
vi: Phát hiện danh mục là không đủ. Kiểm tra tự động sẽ gửi tối đa 1 mã thông báo qua đường dẫn trò chuyện thực và chọn giao thức hoạt động cho bạn.
zh_hans: 仅发现模型目录还不够。自动测试会沿真实聊天路径发送最多 1 token，并替你选择可用协议。
zh_hant: 僅發現模型目錄還不夠。自動測試會沿真實聊天路徑傳送最多 1 token，並替你選擇可用協議。

source: Catalog found, but it returned no model IDs. Enter a model above to continue.
ar: تم العثور على الكتالوج، لكنه لم يُرجع أي معرفات للنماذج. أدخل النموذج أعلاه للمتابعة.
de: Katalog gefunden, aber keine Modell-IDs zurückgegeben. Geben Sie oben ein Modell ein, um fortzufahren.
es: Se encontró el catálogo, pero no arrojó ningún ID de modelo. Ingrese un modelo arriba para continuar.
fr: Catalogue trouvé, mais il n'a renvoyé aucun ID de modèle. Entrez un modèle ci-dessus pour continuer.
hi: कैटलॉग मिला, लेकिन उसने कोई मॉडल आईडी नहीं लौटाई। जारी रखने के लिए ऊपर एक मॉडल दर्ज करें।
id: Katalog ditemukan, namun tidak mengembalikan ID model. Masukkan model di atas untuk melanjutkan.
ja: カタログは見つかりましたが、モデル ID が返されませんでした。続行するには、上にモデルを入力してください。
ko: 카탈로그를 찾았으나 모델 ID가 반환되지 않았습니다. 계속하려면 위의 모델을 입력하세요.
pt_br: Catálogo encontrado, mas não retornou nenhum ID de modelo. Insira um modelo acima para continuar.
ru: Каталог найден, но идентификаторы моделей не возвращены. Введите модель выше, чтобы продолжить.
th: พบแคตตาล็อก แต่ไม่มีรหัสรุ่นส่งคืน ป้อนโมเดลด้านบนเพื่อดำเนินการต่อ
tr: Katalog bulundu ancak model kimliği döndürülmedi. Devam etmek için yukarıya bir model girin.
vi: Đã tìm thấy danh mục nhưng không trả lại ID mẫu nào. Nhập mô hình ở trên để tiếp tục.
zh_hans: 已找到模型目录，但未返回模型 ID。请在上方填写模型后继续。
zh_hant: 已找到模型目錄，但未傳回模型 ID。請在上方填寫模型後繼續。

source: Change
ar: يتغير
de: Ändern
es: Cambiar
fr: Changement
hi: परिवर्तन
id: Mengubah
ja: 変化
ko: 변화
pt_br: Mudar
ru: Изменять
th: เปลี่ยน
tr: Değiştirmek
vi: Thay đổi
zh_hans: 修改
zh_hant: 修改

source: ChatGPT subscription
ar: اشتراك ChatGPT
de: ChatGPT-Abo
es: Suscripción de ChatGPT
fr: Abonnement ChatGPT
hi: ChatGPT सब्सक्रिप्शन
id: Langganan ChatGPT
ja: ChatGPT サブスクリプション
ko: ChatGPT 구독
pt_br: Assinatura do ChatGPT
ru: Подписка ChatGPT
th: การสมัครสมาชิก ChatGPT
tr: ChatGPT aboneliği
vi: Gói đăng ký ChatGPT
zh_hans: ChatGPT 订阅
zh_hant: ChatGPT 訂閱

source: ChatGPT subscription sign-in is temporarily unavailable while we update it. You can connect with an API key instead.
ar: تسجيل الدخول باشتراك ChatGPT غير متاح مؤقتًا أثناء التحديث. يمكنك الاتصال بمفتاح API بدلًا من ذلك.
de: Die Anmeldung mit dem ChatGPT-Abo ist während der Aktualisierung vorübergehend nicht verfügbar. Du kannst stattdessen einen API-Schlüssel verwenden.
es: El inicio de sesión con la suscripción de ChatGPT no está disponible temporalmente mientras lo actualizamos. Puedes conectarte con una clave de API.
fr: La connexion par abonnement ChatGPT est temporairement indisponible pendant la mise à jour. Vous pouvez utiliser une clé API à la place.
hi: ChatGPT सब्सक्रिप्शन साइन-इन अभी अस्थायी रूप से उपलब्ध नहीं है, हम इसे अपडेट कर रहे हैं। आप API की से कनेक्ट कर सकते हैं।
id: Masuk dengan langganan ChatGPT sementara tidak tersedia karena sedang kami perbarui. Anda bisa terhubung dengan kunci API.
ja: ChatGPT サブスクリプションでのログインは現在調整中のため一時的に利用できません。API キーでの接続をご利用ください。
ko: ChatGPT 구독 로그인은 업데이트 중이라 일시적으로 사용할 수 없습니다. 대신 API 키로 연결할 수 있습니다.
pt_br: O login com assinatura do ChatGPT está temporariamente indisponível enquanto atualizamos. Você pode conectar com uma chave de API.
ru: Вход по подписке ChatGPT временно недоступен — мы его обновляем. Пока можно подключиться по API-ключу.
th: การลงชื่อเข้าใช้ด้วยการสมัครสมาชิก ChatGPT ใช้ไม่ได้ชั่วคราวเนื่องจากกำลังปรับปรุง คุณสามารถเชื่อมต่อด้วยคีย์ API แทนได้
tr: ChatGPT abonelik girişi güncelleme sırasında geçici olarak kullanılamıyor. Bunun yerine API anahtarıyla bağlanabilirsin.
vi: Đăng nhập bằng gói đăng ký ChatGPT tạm thời không khả dụng do đang được cập nhật. Bạn có thể kết nối bằng khóa API.
zh_hans: ChatGPT 订阅登录暂时不可用，我们正在适配。你可以先改用 API 密钥连接。
zh_hant: ChatGPT 訂閱登入暫時無法使用，我們正在調整。你可以先改用 API 金鑰連接。

source: Check your API Key
ar: تحقق من مفتاح API
de: Prüfe deinen API-Schlüssel
es: Revisa tu clave API
fr: Vérifiez votre clé API
hi: अपनी API कुंजी जांचें
id: Periksa API Key Anda
ja: API Key を確認してください
ko: API Key를 확인하세요
pt_br: Verifique sua chave de API
ru: Проверьте API-ключ
th: ตรวจสอบ API Key ของคุณ
tr: API Anahtarınızı kontrol edin
vi: Kiểm tra API Key của bạn
zh_hans: 请检查 API Key
zh_hant: 請檢查 API Key

source: Check your key
ar: تحقق من مفتاحك
de: Prüfe deinen Schlüssel
es: Revisa tu clave
fr: Vérifiez votre clé
hi: अपनी कुंजी जाँचें
id: Periksa kunci Anda
ja: キーを確認してください
ko: 키를 확인하세요
pt_br: Verifique sua chave
ru: Проверьте ключ
th: ตรวจสอบคีย์ของคุณ
tr: Anahtarını kontrol et
vi: Kiểm tra khóa của bạn
zh_hans: 检查 Key
zh_hant: 檢查 Key

source: Checking this address...
ar: جارٍ التحقق من هذا العنوان...
de: Diese Adresse wird überprüft...
es: Comprobando esta dirección...
fr: Je vérifie cette adresse...
hi: इस पते की जाँच की जा रही है...
id: Memeriksa alamat ini...
ja: このアドレスを確認中...
ko: 주소를 확인하는 중입니다...
pt_br: Verificando este endereço...
ru: Проверяю этот адрес...
th: กำลังตรวจสอบที่อยู่นี้...
tr: Bu adres kontrol ediliyor...
vi: Đang kiểm tra địa chỉ này...
zh_hans: 正在检查此地址…
zh_hant: 正在檢查此位址…

source: China Mainland (api.minimaxi.com)
ar: البر الرئيسي للصين (api.minimaxi.com)
de: Festlandchina (api.minimaxi.com)
es: China continental (api.minimaxi.com)
fr: Chine continentale (api.minimaxi.com)
hi: चीन मुख्यभूमि (api.minimaxi.com)
id: Tiongkok Daratan (api.minimaxi.com)
ja: 中国本土 (api.minimaxi.com)
ko: 중국 본토 (api.minimaxi.com)
pt_br: China continental (api.minimaxi.com)
ru: Материковый Китай (api.minimaxi.com)
th: จีนแผ่นดินใหญ่ (api.minimaxi.com)
tr: Çin Anakarası (api.minimaxi.com)
vi: Trung Quốc đại lục (api.minimaxi.com)
zh_hans: 中国大陆 (api.minimaxi.com)
zh_hant: 中國大陸 (api.minimaxi.com)

source: China Mainland (api.moonshot.cn)
ar: البر الرئيسي للصين (api.moonshot.cn)
de: Festlandchina (api.moonshot.cn)
es: China continental (api.moonshot.cn)
fr: Chine continentale (api.moonshot.cn)
hi: चीन मुख्यभूमि (api.moonshot.cn)
id: Tiongkok Daratan (api.moonshot.cn)
ja: 中国本土 (api.moonshot.cn)
ko: 중국 본토 (api.moonshot.cn)
pt_br: China continental (api.moonshot.cn)
ru: Материковый Китай (api.moonshot.cn)
th: จีนแผ่นดินใหญ่ (api.moonshot.cn)
tr: Çin Anakarası (api.moonshot.cn)
vi: Trung Quốc đại lục (api.moonshot.cn)
zh_hans: 中国大陆（api.moonshot.cn）
zh_hant: 中國大陸（api.moonshot.cn）

source: China Mainland (api.siliconflow.cn)
ar: البر الرئيسي للصين (api.siliconflow.cn)
de: Festlandchina (api.siliconflow.cn)
es: China continental (api.siliconflow.cn)
fr: Chine continentale (api.siliconflow.cn)
hi: चीन मुख्यभूमि (api.siliconflow.cn)
id: Tiongkok Daratan (api.siliconflow.cn)
ja: 中国本土 (api.siliconflow.cn)
ko: 중국 본토 (api.siliconflow.cn)
pt_br: China continental (api.siliconflow.cn)
ru: Материковый Китай (api.siliconflow.cn)
th: จีนแผ่นดินใหญ่ (api.siliconflow.cn)
tr: Çin Anakarası (api.siliconflow.cn)
vi: Trung Quốc đại lục (api.siliconflow.cn)
zh_hans: 中国大陆（api.siliconflow.cn）
zh_hant: 中國大陸（api.siliconflow.cn）

source: Choose a protocol manually
ar: اختر البروتوكول يدويًا
de: Wählen Sie manuell ein Protokoll aus
es: Elija un protocolo manualmente
fr: Choisir un protocole manuellement
hi: मैन्युअल रूप से एक प्रोटोकॉल चुनें
id: Pilih protokol secara manual
ja: プロトコルを手動で選択する
ko: 수동으로 프로토콜 선택
pt_br: Escolha um protocolo manualmente
ru: Выберите протокол вручную
th: เลือกโปรโตคอลด้วยตนเอง
tr: Manuel olarak bir protokol seçin
vi: Chọn một giao thức theo cách thủ công
zh_hans: 手动选择协议
zh_hant: 手動選擇協議

# Choose relay type
source: Choose protocol type
ar: اختر نوع البروتوكول
de: Protokolltyp wählen
es: Elegir tipo de protocolo
fr: Choisir le type de protocole
hi: प्रोटोकॉल प्रकार चुनें
id: Pilih jenis protokol
ja: プロトコルの種類を選択
ko: 프로토콜 유형 선택
pt_br: Escolher tipo de protocolo
ru: Выберите тип протокола
th: เลือกประเภทโปรโตคอล
tr: Protokol türünü seç
vi: Chọn loại giao thức
zh_hans: 选择协议类型
zh_hant: 選擇協議類型

source: Choose your AI provider, then enter your API key
ar: اختر مزوّد الذكاء الاصطناعي، ثم أدخل مفتاح API
de: Wähle deinen KI-Anbieter und gib dann deinen API-Schlüssel ein
es: Elige tu proveedor de IA y luego introduce tu clave de API
fr: Choisissez votre fournisseur d'IA, puis saisissez votre clé API
hi: अपना AI प्रदाता चुनें, फिर अपनी API कुंजी दर्ज करें
id: Pilih penyedia AI Anda, lalu masukkan kunci API Anda
ja: AIプロバイダーを選択し、APIキーを入力してください
ko: AI 제공업체를 선택한 다음 API 키를 입력하세요
pt_br: Escolha seu provedor de IA e insira sua chave de API
ru: Выберите провайдера ИИ, затем введите ключ API
th: เลือกผู้ให้บริการ AI ของคุณ จากนั้นป้อนคีย์ API
tr: Yapay zekâ sağlayıcını seç, ardından API anahtarını gir
vi: Chọn nhà cung cấp AI của bạn, rồi nhập khóa API
zh_hans: 选择 AI 服务商，再填入 API 密钥
zh_hant: 選擇 AI 服務商，再填入 API 金鑰

source: Clear capability filters
ar: مسح مرشّحات القدرات
de: Fähigkeitsfilter zurücksetzen
es: Borrar filtros de capacidad
fr: Effacer les filtres de capacités
hi: क्षमता फ़िल्टर हटाएँ
id: Hapus filter kemampuan
ja: 機能フィルタをクリア
ko: 기능 필터 지우기
pt_br: Limpar filtros de capacidade
ru: Сбросить фильтры возможностей
th: ล้างตัวกรองความสามารถ
tr: Yetenek filtrelerini temizle
vi: Xoá bộ lọc khả năng
zh_hans: 清除能力筛选
zh_hant: 清除能力篩選

source: Clear learned capabilities
ar: مسح الإمكانات المتعلمة
de: Erlernte Funktionen löschen
es: Borrar capacidades aprendidas
fr: Effacer les capacités apprises
hi: सीखी गई क्षमताएँ हटाएँ
id: Hapus kemampuan yang dipelajari
ja: 学習済みの機能を消去
ko: 학습된 기능 지우기
pt_br: Limpar recursos aprendidos
ru: Очистить изученные возможности
th: ล้างความสามารถที่เรียนรู้
tr: Öğrenilen yetenekleri temizle
vi: Xóa các khả năng đã học
zh_hans: 清除已学习的能力
zh_hant: 清除已學習的能力

source: Compatibility
ar: التوافق
de: Kompatibilität
es: Compatibilidad
fr: Compatibilité
hi: संगतता
id: Kompatibilitas
ja: 互換性
ko: 호환성
pt_br: Compatibilidade
ru: Совместимость
th: ความเข้ากันได้
tr: Uyumluluk
vi: Khả năng tương thích
zh_hans: 兼容性
zh_hant: 相容性

source: Compatibility profiles
ar: ملفات التوافق
de: Kompatibilitätsprofile
es: Perfiles de compatibilidad
fr: Profils de compatibilité
hi: संगतता प्रोफ़ाइल
id: Profil kompatibilitas
ja: 互換プロファイル
ko: 호환 프로필
pt_br: Perfis de compatibilidade
ru: Профили совместимости
th: โปรไฟล์ความเข้ากันได้
tr: Uyumluluk profilleri
vi: Hồ sơ tương thích
zh_hans: 兼容协议
zh_hant: 相容協定

source: Confirm unencrypted connection
ar: قم بتأكيد الاتصال غير المشفر
de: Bestätigen Sie die unverschlüsselte Verbindung
es: Confirmar conexión no cifrada
fr: Confirmer la connexion non cryptée
hi: अनएन्क्रिप्टेड कनेक्शन की पुष्टि करें
id: Konfirmasi koneksi tidak terenkripsi
ja: 暗号化されていない接続を確認します
ko: 암호화되지 않은 연결을 확인하세요.
pt_br: Confirme a conexão não criptografada
ru: Подтвердить незашифрованное соединение
th: ยืนยันการเชื่อมต่อที่ไม่ได้เข้ารหัส
tr: Şifrelenmemiş bağlantıyı onaylayın
vi: Xác nhận kết nối không được mã hóa
zh_hans: 确认不加密连接
zh_hant: 確認未加密連線

source: Confirmed the %@ protocol, but this custom LLM does not publish a model catalog. Enter a model ID above to continue.
ar: تم تأكيد بروتوكول %@، لكن هذا النموذج اللغوي الكبير المخصص لا ينشر كتالوج نماذج. أدخل معرّف نموذج بالأعلى للمتابعة.
de: Das Protokoll %@ wurde bestätigt, aber dieses benutzerdefinierte LLM veröffentlicht keinen Modellkatalog. Geben Sie oben eine Modell-ID ein, um fortzufahren.
es: Se confirmó el protocolo %@, pero este LLM personalizado no publica un catálogo de modelos. Introduce un ID de modelo arriba para continuar.
fr: Le protocole %@ est confirmé, mais ce LLM personnalisé ne publie pas de catalogue de modèles. Saisissez un ID de modèle ci-dessus pour continuer.
hi: %@ प्रोटोकॉल की पुष्टि हो गई, लेकिन यह कस्टम LLM मॉडल कैटलॉग प्रकाशित नहीं करता। जारी रखने के लिए ऊपर एक मॉडल ID दर्ज करें।
id: Protokol %@ dikonfirmasi, tetapi LLM kustom ini tidak menerbitkan katalog model. Masukkan ID model di atas untuk melanjutkan.
ja: %@ プロトコルを確認しました。ただしこのカスタム LLM はモデルカタログを公開していません。続けるには上でモデル ID を入力してください。
ko: %@ 프로토콜을 확인했습니다. 다만 이 사용자 지정 LLM은 모델 카탈로그를 제공하지 않습니다. 계속하려면 위에 모델 ID를 입력하세요.
pt_br: Protocoloo %@ confirmado, mas este LLM personalizado não publica um catálogo de modelos. Informe um ID de modelo acima para continuar.
ru: Протокол %@ подтверждён, но эта пользовательская LLM не публикует каталог моделей. Введите ID модели выше, чтобы продолжить.
th: ยืนยันโปรโตคอล %@ แล้ว แต่ LLM แบบกำหนดเองนี้ไม่เผยแพร่แค็ตตาล็อกโมเดล กรอก ID โมเดลด้านบนเพื่อดำเนินการต่อ
tr: %@ protokolü doğrulandı, ancak bu aktarıcı bir model kataloğu yayınlamıyor. Devam etmek için yukarıya bir model kimliği girin.
vi: Đã xác nhận giao thức %@, nhưng LLM tùy chỉnh này không công bố danh mục mô hình. Nhập ID mô hình ở trên để tiếp tục.
zh_hans: 已确认协议为 %@，但这个自定义 LLM 不提供模型目录。请在上方填入模型 ID 后继续。
zh_hant: 已確認協議為 %@，但這個自訂 LLM 不提供模型目錄。請在上方填入模型 ID 後繼續。

source: Connect %@
ar: ربط %@
de: %@ verbinden
es: Conectar %@
fr: Connecter %@
hi: %@ कनेक्ट करें
id: Hubungkan %@
ja: %@を接続
ko: %@ 연결
pt_br: Conectar %@
ru: Подключить %@
th: เชื่อมต่อ %@
tr: %@ bağla
vi: Kết nối %@
zh_hans: 连接 %@
zh_hant: 連接 %@

source: Connect Ollama, LM Studio, llama.cpp, or vLLM
ar: اتصل بـ Ollama أو LM Studio أو llama.cpp أو vLLM
de: Ollama, LM Studio, llama.cpp oder vLLM verbinden
es: Conecta Ollama, LM Studio, llama.cpp o vLLM
fr: Connecter Ollama, LM Studio, llama.cpp ou vLLM
hi: Ollama, LM Studio, llama.cpp या vLLM कनेक्ट करें
id: Hubungkan Ollama, LM Studio, llama.cpp, atau vLLM
ja: Ollama、LM Studio、llama.cpp、vLLM に接続
ko: Ollama, LM Studio, llama.cpp 또는 vLLM 연결
pt_br: Conecte Ollama, LM Studio, llama.cpp ou vLLM
ru: Подключить Ollama, LM Studio, llama.cpp или vLLM
th: เชื่อมต่อ Ollama, LM Studio, llama.cpp หรือ vLLM
tr: Ollama, LM Studio, llama.cpp veya vLLM bağlayın
vi: Kết nối Ollama, LM Studio, llama.cpp hoặc vLLM
zh_hans: 连接 Ollama、LM Studio、llama.cpp 或 vLLM
zh_hant: 連接 Ollama、LM Studio、llama.cpp 或 vLLM

source: Connect a Provider
ar: ربط مزوّد
de: Anbieter verbinden
es: Conectar un proveedor
fr: Connecter un fournisseur
hi: प्रदाता कनेक्ट करें
id: Hubungkan Penyedia
ja: プロバイダーを接続
ko: 제공업체 연결
pt_br: Conectar um provedor
ru: Подключить провайдера
th: เชื่อมต่อผู้ให้บริการ
tr: Sağlayıcı bağla
vi: Kết nối nhà cung cấp
zh_hans: 连接服务商
zh_hant: 連接服務商

source: Connect a provider first. Model switching, chat, and cost transparency all start here.
ar: قم بتوصيل المزود أولاً. يبدأ تبديل النماذج والدردشة وشفافية التكلفة هنا.
de: Verbinde zunächst einen Anbieter. Hier beginnen Modellwechsel, Chat und Kostentransparenz.
es: Primero conecte un proveedor. El cambio de modelo, el chat y la transparencia de costos comienzan aquí.
fr: Connectez d’abord un fournisseur. Le changement de modèle, le chat et la transparence des coûts commencent ici.
hi: पहले एक प्रदाता कनेक्ट करें. मॉडल स्विचिंग, चैट और लागत पारदर्शिता सभी यहीं से शुरू होते हैं।
id: Hubungkan penyedia terlebih dahulu. Peralihan model, obrolan, dan transparansi biaya semuanya dimulai di sini.
ja: まずプロバイダーに接続します。モデルの切り替え、チャット、コストの透明性はすべてここから始まります。
ko: 먼저 제공업체를 연결하세요. 모델 전환, 채팅, 비용 투명성이 모두 여기에서 시작됩니다.
pt_br: Conecte um provedor primeiro. A troca de modelos, o chat e a transparência de custos começam aqui.
ru: Сначала подключите провайдера. Переключение моделей, чат и прозрачность затрат — все начинается здесь.
th: เชื่อมต่อผู้ให้บริการก่อน การสลับโมเดล การแชท และความโปร่งใสด้านต้นทุนทั้งหมดเริ่มต้นที่นี่
tr: Önce bir sağlayıcıya bağlanın. Model değiştirme, sohbet ve maliyet şeffaflığının tamamı burada başlıyor.
vi: Kết nối một nhà cung cấp đầu tiên. Chuyển đổi mô hình, trò chuyện và minh bạch chi phí đều bắt đầu từ đây.
zh_hans: 先连接一个服务商。模型切换、聊天和费用透明都从这里开始。
zh_hant: 首先連接服務商。模型切換、聊天和成本透明度都從這裡開始。
